[
  {
    "product_id": "1",
    "admin_id": "10",
    "name": "Harry Potter y la piedra filosofal",
    "author": "J.K. Rowling",
    "description": "Harry Potter, quien descubre en su undécimo cumpleaños que es un mago y que ha sido aceptado en el prestigioso colegio Hogwarts de Magia y Hechicería. A medida que Harry se adentra en el mundo mágico, se enfrenta a desafíos inesperados, forja amistades inquebrantables y descubre la verdad sobre su pasado, incluyendo la oscura historia de su familia y su conexión con el temido Lord Voldemort. Este primer libro de la serie no solo introduce a los lectores a un universo lleno de magia, criaturas fantásticas y aventuras emocionantes, sino que también aborda temas de amistad, valentía y la lucha entre el bien y el mal.",
    "unit": 1,
    "price": 39.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_1",
    "category": "FANTASIA"
  },
  {
    "product_id": "2",
    "admin_id": "10",
    "name": "El Señor de los Anillos: La Comunidad del Anillo",
    "author": "J.R.R. Tolkien",
    "description": "En un mundo donde la Tierra Media está amenazada por el poder del Anillo Único, un grupo diverso de héroes se une en una épica búsqueda para destruirlo. Desde el hobbit Frodo Bolsón, quien hereda el Anillo, hasta el sabio Gandalf, el noble Aragorn y la valiente Legolas, cada miembro de la Comunidad del Anillo debe enfrentar sus propios miedos y desafíos. A medida que atraviesan paisajes deslumbrantes y peligrosos, se enfrentan a las fuerzas oscuras de Sauron, que buscan recuperar el Anillo para dominar el mundo. Esta obra maestra de la fantasía no solo es una aventura emocionante, sino también una profunda exploración de la amistad, el sacrificio y la lucha contra la tiranía.",
    "unit": 1,
    "price": 49.99,
    "discount": 15,
    "discount_type": "PERCENTAGE",
    "image": "P_2",
    "category": "FANTASIA"
  },
  {
    "product_id": "3",
    "admin_id": "10",
    "name": "Juego de tronos",
    "author": "George R.R. Martin",
    "description": "En un mundo donde las estaciones pueden durar años y la lucha por el Trono de Hierro es implacable, varias casas nobles se enfrentan en una batalla épica por el poder. Desde los Stark del Norte, que valoran el honor y la lealtad, hasta los Lannister, que juegan un juego de intrigas y traiciones, cada personaje tiene sus propias ambiciones y secretos. A medida que la guerra se desata y los muertos comienzan a levantarse, los protagonistas deben navegar por un paisaje de alianzas cambiantes y decisiones morales difíciles. 'Juego de tronos' es una saga compleja que explora la naturaleza humana, la ambición y las consecuencias de la guerra.",
    "unit": 1,
    "price": 45.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_3",
    "category": "FANTASIA"
  },
  {
    "product_id": "4",
    "admin_id": "10",
    "name": "Cómo matar a un ruiseñor",
    "author": "Harper Lee",
    "description": "Ambientada en el sur de Estados Unidos durante la Gran Depresión, esta novela narra la historia de Scout Finch, una niña que observa la lucha de su padre, Atticus Finch, por defender a un hombre negro acusado injustamente de violación. A través de los ojos de Scout, el lector es testigo de la injusticia racial y la pérdida de la inocencia en una sociedad marcada por el prejuicio. La obra aborda temas de moralidad, empatía y la importancia de luchar por lo que es correcto, convirtiéndose en un clásico atemporal que resuena con las luchas contemporáneas por la justicia social.",
    "unit": 1,
    "price": 25.00,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_4",
    "category": "DRAMA"
  },
  {
    "product_id": "5",
    "admin_id": "10",
    "name": "Orgullo y Prejuicio",
    "author": "Jane Austen",
    "description": "En esta novela clásica, Jane Austen presenta la historia de Elizabeth Bennet, una joven inteligente y decidida que navega por las complejidades del amor y las expectativas sociales en la Inglaterra del siglo XIX. A medida que Elizabeth se enfrenta a la presión de su familia para casarse, su vida se entrelaza con la de Mr. Darcy, un hombre rico y orgulloso. A través de malentendidos, prejuicios y revelaciones, ambos personajes deben confrontar sus propios defectos y aprender a valorar lo que realmente importa. 'Orgullo y Prejuicio' es una aguda crítica social que explora temas de clase, matrimonio y la búsqueda de la felicidad personal.",
    "unit": 1,
    "price": 20.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_5",
    "category": "DRAMA"
  },
  {
    "product_id": "6",
    "admin_id": "10",
    "name": "El imperio final",
    "author": "Brandon Sanderson",
    "description": "En un mundo donde la magia se basa en metales y la opresión es la norma, se sigue la historia de Vin, una joven que descubre su potencial como una poderosa alomántica. A medida que se une a un grupo de rebeldes liderados por el carismático Kelsier, Vin se embarca en una misión para derrocar al Lord Legislador, un tirano que ha gobernado durante mil años. La novela combina elementos de fantasía épica con intriga política y exploraciones profundas sobre la libertad, la confianza y el sacrificio. A través de giros inesperados y un desarrollo de personajes excepcional, Sanderson crea un mundo rico y cautivador.",
    "unit": 1,
    "price": 22.50,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_6",
    "category": "FANTASIA"
  },
  {
    "product_id": "7",
    "admin_id": "10",
    "name": "El camino de los reyes",
    "author": "Brandon Sanderson",
    "description": "En un mundo devastado por tormentas y guerras, 'El camino de los reyes' narra la historia de varios personajes cuyas vidas se entrelazan en una lucha por la supervivencia y el poder. Desde el noble Kaladin Stormblessed, que lucha contra la opresión, hasta Shallan Davar, una joven con un oscuro pasado que busca redención, cada personaje enfrenta sus propios desafíos y debe tomar decisiones difíciles. La novela es una exploración épica de la lucha entre el bien y el mal, la amistad y la traición, y la búsqueda de la verdad en un mundo lleno de secretos.",
    "unit": 1,
    "price": 35.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_7",
    "category": "FANTASIA"
  },
  {
    "product_id": "8",
    "admin_id": "10",
    "name": "Carrie",
    "author": "Stephen King",
    "description": "La primera novela de Stephen King, 'Carrie', cuenta la historia de una adolescente marginada que descubre que tiene poderes telequinéticos. A medida que Carrie White enfrenta el acoso escolar y la opresión de su madre religiosa, su dolor y sufrimiento la llevan a desatar su ira de maneras devastadoras. La novela explora temas de bullying, venganza y la lucha por la aceptación, mientras King crea una atmósfera de terror psicológico que mantiene a los lectores al borde de sus asientos. 'Carrie' es una poderosa reflexión sobre el dolor de la adolescencia y las consecuencias de la crueldad.",
    "unit": 1,
    "price": 30.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_8",
    "category": "TERROR"
  },
  {
    "product_id": "9",
    "admin_id": "10",
    "name": "La isla del tesoro",
    "author": "Robert Louis Stevenson",
    "description": "Una emocionante aventura de piratas, 'La isla del tesoro' sigue a Jim Hawkins, un joven que encuentra un mapa del tesoro y se embarca en un viaje lleno de peligros y traiciones. A bordo del barco Hispani ola, Jim se encuentra con el misterioso Long John Silver, un cocinero con una pierna de palo y un pasado oscuro. A medida que la tripulación se acerca a la isla del tesoro, Jim debe enfrentar desafíos inesperados y tomar decisiones difíciles. La novela es una exploración emocionante de la amistad, la traición y la búsqueda de la riqueza, con un final inesperado que deja a los lectores con ganas de más.",
    "unit": 1,
    "price": 18.99,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_9",
    "category": "AVENTURA"
  },
  {
    "product_id": "10",
    "admin_id": "10",
    "name": "1984",
    "author": "George Orwell",
    "description": "En un mundo distópico donde la vigilancia es omnipresente y la libertad es un recuerdo lejano, '1984' sigue a Winston Smith, un hombre que trabaja en el Ministerio de la Verdad, donde se encarga de reescribir la historia para adaptarla a la narrativa del Partido. A medida que Winston se rebela contra el sistema y se enamora de una mujer llamada Julia, se enfrenta a las consecuencias de su desobediencia. La novela es una poderosa crítica de la sociedad totalitaria y la manipulación de la verdad, con un final impactante que deja a los lectores reflexionando sobre la importancia de la libertad y la resistencia.",
    "unit": 1,
    "price": 25.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_10",
    "category": "DRAMA"
  },
  {
    "product_id": "11",
    "admin_id": "10",
    "name": "Los Héroes",
    "author": "Joe Abercrombie",
    "description": "En un mundo lleno de conflictos y decisiones difíciles, 'Los Héroes' sigue a un grupo de guerreros que se enfrentan a sus propios demonios mientras luchan por la supervivencia y la gloria. Desde el veterano Bremer dan Gorst, que busca redención, hasta el joven Curnden Craw, que lucha por encontrar su lugar en el mundo, cada personaje tiene su propia historia y motivaciones. La novela es una exploración épica de la guerra, la amistad y la búsqueda de la identidad, con un final impactante que deja a los lectores reflexionando sobre la naturaleza de la heroicidad.",
    "unit": 1,
    "price": 19.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_11",
    "category": "FANTASIA"
  },
  {
    "product_id": "12",
    "admin_id": "10",
    "name": "La mejor venganza",
    "author": "Joe Abercrombie",
    "description": "En un mundo lleno de ironía y reflexiones profundas, 'La mejor venganza' sigue a un adolescente que observa la sociedad y el mundo de los adultos desde una perspectiva única. A medida que el protagonista se enfrenta a los desafíos de la vida y la búsqueda de la identidad, se encuentra en medio de una lucha por el poder y la venganza. La novela es una exploración profunda de la naturaleza humana, la ambición y la búsqueda de la justicia, con un final impactante que deja a los lectores reflexionando sobre la complejidad de la vida.",
    "unit": 1,
    "price": 18.99, "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_12",
    "category": "FANTASIA"
  },
  {
    "product_id": "13",
    "admin_id": "10",
    "name": "Moby Dick",
    "author": "Herman Melville",
    "description": "La épica caza de la gran ballena blanca, Moby Dick, es narrada por Ishmael, un marinero que se une al barco Pequod, capitaneado por el obsesivo Ahab. A medida que la tripulación se adentra en los mares, la historia explora temas de obsesión, venganza y la lucha del hombre contra la naturaleza. Ahab, consumido por su deseo de venganza, arrastra a su tripulación en una búsqueda peligrosa que desafía las leyes de la naturaleza y la moralidad. 'Moby Dick' es una obra maestra que combina aventura, filosofía y una profunda reflexión sobre la condición humana.",
    "unit": 1,
    "price": 29.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_13",
    "category": "AVENTURA"
  },
  {
    "product_id": "14",
    "admin_id": "10",
    "name": "Mujercitas",
    "author": "Louisa May Alcott",
    "description": "La historia de las hermanas March, Meg, Jo, Beth y Amy, se desarrolla en la América posterior a la Guerra Civil, donde cada una de ellas enfrenta sus propios desafíos y aspiraciones. A través de sus experiencias, la novela explora temas de amor, familia, sacrificio y la búsqueda de la identidad femenina en un mundo que a menudo limita sus opciones. A medida que las hermanas crecen y enfrentan las dificultades de la vida, su vínculo se fortalece, y cada una aprende a encontrar su propio camino hacia la felicidad y la realización personal. 'Mujercitas' es un clásico que resuena con generaciones de lectores.",
    "unit": 1,
    "price": 24.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_14",
    "category": "DRAMA"
  },
  {
    "product_id": "15",
    "admin_id": "10",
    "name": "Dune",
    "author": "Frank Herbert",
    "description": "En un futuro lejano, 'Dune' narra la historia de Paul Atreides, un joven noble cuya familia es traicionada en el planeta desértico de Arrakis, la única fuente de la especia melange, un recurso vital para el viaje intergaláctico. A medida que Paul se embarca en un viaje de venganza y autodescubrimiento, se convierte en el líder de los Fremen, los habitantes nativos de Arrakis, y debe enfrentar profecías, intrigas políticas y su propio destino. La novela es una exploración profunda de la política, la religión y la ecología, convirtiéndose en un clásico de la ciencia ficción que ha influido en generaciones de escritores y cineastas.",
    "unit": 1,
    "price": 34.99,
    "discount": 15,
    "discount_type": "PERCENTAGE",
    "image": "P_15",
    "category": "FANTASIA"
  },
  {
    "product_id": "16",
    "admin_id": "10",
    "name": "El Hobbit",
    "author": "J.R.R. Tolkien",
    "description": "La historia de Bilbo Bolsón, un hobbit que vive una vida tranquila en la Comarca, cambia drásticamente cuando el mago Gandalf y un grupo de enanos lo reclutan para una aventura épica. Juntos, se embarcan en un viaje para recuperar el tesoro robado por el dragón Smaug. A lo largo de su travesía, Bilbo se enfrenta a trolls, goblins y criaturas mágicas, descubriendo su propio valor y astucia. 'El Hobbit' es una obra que combina humor, aventura y lecciones sobre la amistad y el heroísmo, estableciendo las bases para la famosa trilogía de 'El Señor de los Anillos'.",
    "unit": 1,
    "price": 40.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_16",
    "category": "FANTASIA"
  },
  {
    "product_id": "17",
    "admin_id": "10",
    "name": "Las Crónicas de Narnia",
    "author": "C.S. Lewis",
    "description": "A través de un armario mágico, cuatro hermanos son transportados al mundo de Narnia, donde descubren un reino lleno de criaturas fantásticas y una lucha épica entre el bien y el mal. En Narnia, se encuentran con Aslan, el gran león, quien representa la esperanza y la justicia, y deben unirse a él para liberar a Narnia del dominio de la malvada Reina Blanca. A medida que los hermanos enfrentan desafíos y descubren su propio valor, la historia explora temas de sacrificio, redención y la lucha contra la opresión. 'Las Crónicas de Narnia' es una obra que ha cautivado a generaciones, combinando aventura, magia y profundas lecciones morales.",
    "unit": 1,
    "price": 45.00,
    "discount": 15,
    "discount_type": "PERCENTAGE",
    "image": "P_17",
    "category": "FANTASIA"
  },
  {
    "product_id": "18",
    "admin_id": "10",
    "name": "Edad oscura",
    "author": "Pierce Brown",
    "description": "En un mundo devastado por la guerra y la opresión, 'Edad oscura' sigue la historia de un grupo de jóvenes que luchan por encontrar su lugar en una sociedad en crisis. A medida que se enfrentan a conflictos internos y externos, deben aprender a confiar en sus instintos y en los demás para sobrevivir. La novela explora temas de amistad, redención y la lucha por la libertad en un contexto de desesperación y esperanza. Con personajes complejos y un mundo vibrante, esta historia cautiva a los lectores y los invita a reflexionar sobre la naturaleza de la humanidad.",
    "unit": 1,
    "price": 21.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_18",
    "category": "FANTASIA"
  },
  {
    "product_id": "19",
    "admin_id": "10",
    "name": "El portador de luz",
    "author": "Pierce Brown",
    "description": "En un mundo contemporáneo lleno de mitología y conflictos, 'El portador de luz' narra las aventuras de un semidiós que lucha por la justicia y la verdad. A medida que se enfrenta a enemigos poderosos y descubre secretos sobre su propia identidad, el protagonista debe aprender a equilibrar su legado divino con su humanidad. La novela es una exploración emocionante de la lucha entre el bien y el mal, la familia y la amistad, y la búsqueda de la verdad en un mundo lleno de engaños.",
    "unit": 1,
    "price": 28.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_19",
    "category": "CIENCIA FICCIÓN"
  },
  {
    "product_id": "20",
    "admin_id": "10",
    "name": "El cuarto mono",
    "author": "J.D Barker",
    "description": "En 'El cuarto mono', un thriller psicológico, un detective se encuentra en la búsqueda de un asesino en serie que ha dejado pistas enigmáticas. A medida que desentraña la historia detrás de los crímenes, se enfrenta a sus propios demonios y secretos del pasado. La novela combina elementos de misterio, suspenso y exploraciones profundas de la psicología humana, manteniendo a los lectores al borde de sus asientos mientras se revelan giros inesperados en la trama.",
    "unit": 1,
    "price": 15.99,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_20",
    "category": "DRAMA"
  },
  {
    "product_id": "21",
    "admin_id": "10",
    "name": "El ojo del mundo",
    "author": "Robert Jordan",
    "description": "En 'El ojo del mundo', el primer libro de la serie 'La rueda del tiempo', un grupo de jóvenes se ve envuelto en una lucha épica contra las fuerzas del mal. A medida que descubren sus propios poderes y destinos, deben unirse para enfrentar a un antiguo enemigo que busca destruir el mundo. La novela es una rica mezcla de fantasía, aventura y desarrollo de personajes, explorando temas de amistad, sacrificio y la lucha entre el bien y el mal en un mundo lleno de magia y misterio.",
    "unit":  1,
    "price": 32.50,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_21",
    "category": "FANTASIA"
  },
  {
    "product_id": "22",
    "admin_id": "10",
    "name": "Viento y Verdad",
    "author": "Brandon Sanderson",
    "description": "En 'Viento y Verdad', los héroes regresan a casa tras la Guerra de Troya, enfrentándose a sus propios demonios y a las consecuencias de sus acciones. A medida que navegan por un mundo lleno de traiciones y alianzas, deben aprender a reconciliar su pasado con su futuro. La novela es una exploración profunda de la redención, la amistad y la lucha por la verdad en un contexto épico, donde cada decisión puede cambiar el destino de muchos.",
    "unit": 1,
    "price": 27.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_22",
    "category": "FANTASIA"
  },
  {
    "product_id": "23",
    "admin_id": "10",
    "name": "IT",
    "author": "Stephen King",
    "description": "En 'IT', un grupo de amigos de la infancia se reúne para enfrentar a un antiguo mal que ha regresado a su pueblo natal. A medida que desenterran oscuros secretos y enfrentan sus propios miedos, deben unirse para derrotar a Pennywise, un ser que se alimenta del miedo de los niños. La novela es una poderosa exploración de la amistad, la valentía y la lucha contra el mal, combinando elementos de terror psicológico con una profunda reflexión sobre la infancia y la pérdida.",
    "unit": 1,
    "price": 30.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_23",
    "category": "TERROR"
  },
  {
    "product_id": "24",
    "admin_id": "10",
    "name": "Cementerio de animales",
    "author": "Stephen King",
    "description": "En 'Cementerio de animales', un joven padre se enfrenta a la pérdida y la desesperación cuando su mascota es atropellada. Al descubrir un antiguo cementerio que tiene el poder de devolver a los muertos a la vida, toma una decisión que cambiará su vida y la de su familia para siempre. La novela explora los límites de la vida y la muerte, así como las consecuencias de jugar con fuerzas que no se comprenden. Con un ambiente inquietante y personajes complejos, King crea una historia que deja una profunda impresión.",
    "unit": 1,
    "price": 35.00,
    "discount": 15,
    "discount_type": "PERCENTAGE",
    "image": "P_24",
    "category": "TERROR"
  },
  {
    "product_id": "25",
    "admin_id": "10",
    "name": "El resplandor",
    "author": "Stephen King",
    "description": "En 'El resplandor', Jack Torrance, un escritor en busca de redención, acepta un trabajo como cuidador de un hotel aislado. A medida que el invierno avanza y el aislamiento se intensifica, Jack comienza a perder su cordura, influenciado por las fuerzas sobrenaturales del hotel. Su esposa Wendy y su hijo Danny, que posee habilidades psíquicas, deben luchar por sobrevivir mientras la locura de Jack se desata. La novela es un estudio escalofriante de la locura, la violencia y el terror psicológico, convirtiéndose en un clásico del género.",
    "unit": 1,
    "price": 29.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_25",
    "category": "TERROR"
  },
  {
    "product_id": "26",
    "admin_id": "10",
    "name": "Y no quedó ninguno",
    "author": "Agatha Christie",
    "description": "En 'Y no quedó ninguno', diez extraños son invitados a una isla remota, donde pronto descubren que están siendo asesinados uno por uno. A medida que la tensión aumenta y la paranoia se apodera de ellos, cada personaje debe enfrentarse a sus propios secretos y culpas. La novela es un thriller psicológico que mantiene a los lectores en vilo, explorando la naturaleza del crimen y la justicia, mientras se desvela un misterio que desafía las expectativas. Con giros inesperados y un final impactante, Christie crea una obra maestra del misterio que ha cautivado a generaciones de lectores.",
    "unit": 1,
    "price": 18.99,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_26",
    "category": "MISTERIO"
  },
  {
    "product_id": "27",
    "admin_id": "10",
    "name": "Muerte en el Nilo",
    "author": "Agatha Christie",
    "description": "En 'Muerte en el Nilo', el famoso detective Hercule Poirot se embarca en un crucero por el Nilo, donde se ve envuelto en un misterio de asesinato. Cuando una rica heredera es asesinada, Poirot debe desentrañar una red de engaños y secretos entre los pasajeros. La novela combina un entorno exótico con un intrincado juego de deducción, explorando temas de amor, celos y venganza. Con un final sorprendente, Christie demuestra su maestría en la creación de tramas complejas y personajes memorables.",
    "unit": 1,
    "price": 24.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_27",
    "category": "MISTERIO"
  },
  {
    "product_id": "28",
    "admin_id": "10",
    "name": "Verity",
    "author": "Coleen Hoover",
    "description": "En 'Verity', una joven escritora se encuentra atrapada en un mundo de secretos y revelaciones cuando acepta completar la serie de libros de una autora famosa que ha quedado incapacitada. A medida que lee los manuscritos de Verity, descubre verdades inquietantes sobre su vida y su familia. La novela es un thriller psicológico que explora la ambigüedad de la verdad y la ficción, desafiando las percepciones de los personajes y los lectores. Con giros inesperados y una atmósfera tensa, 'Verity' mantiene a los lectores al borde de sus asientos.",
    "unit": 1,
    "price": 22.50,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_28",
    "category": "MISTERIO"
  },
  {
    "product_id": "29",
    "admin_id": "10",
    "name": "La guerra de la amapola",
    "author": "R.F. Kuang",
    "description": "En 'La guerra de la amapola', la autora presenta un mundo distópico donde la perfección artificial se enfrenta a la lucha por la libertad. La historia sigue a un grupo de jóvenes que se rebelan contra un sistema opresivo que controla sus vidas. A medida que se enfrentan a desafíos y sacrificios, deben encontrar su voz y luchar por un futuro mejor. La novela es una poderosa reflexión sobre la resistencia, la identidad y el costo de la guerra, combinando elementos de fantasía y crítica social.",
    "unit": 1,
    "price": 27.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_29",
    "category": "AVENTURA"
  },
  {
    "product_id": "30",
    "admin_id": "10",
    "name": "El nombre del viento",
    "author": "Patrick Rothfuss",
    "description": "En 'El nombre del viento', Kvothe, un joven prodigio, narra su vida llena de aventuras, magia y tragedia. Desde su infancia en una troupe de artistas hasta su tiempo en la Universidad, Kvothe enfrenta desafíos que lo moldean como persona y como mago. La novela es una exploración profunda de la identidad, la memoria y el poder de las historias. Con una prosa lírica y un mundo ricamente construido, Rothfuss crea una obra que cautiva a los lectores y los invita a reflexionar sobre el significado de la verdad y la leyenda.",
    "unit": 1,
    "price": 19.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_30",
    "category": "FANTASIA"
  },
  {
    "product_id": "31",
    "admin_id": "10",
    "name": "Amanecer rojo",
    "author": "Pierce Brown",
    "description": "En 'Amanecer rojo', la historia se desarrolla en un futuro dist ópico donde la sociedad está dividida en castas y los colores determinan el estatus de cada individuo. Darrow, un joven de la casta roja, trabaja en las minas, creyendo que su sacrificio es por el bien de la humanidad. Sin embargo, tras una serie de eventos trágicos, se une a una rebelión que busca derrocar a la opresiva élite dorada. A medida que Darrow se infiltra en la sociedad de los dorados, debe aprender a navegar por un mundo de intrigas, traiciones y luchas de poder. La novela es una intensa exploración de la lucha por la libertad, la identidad y el costo de la revolución, manteniendo a los lectores al borde de sus asientos con giros inesperados y un desarrollo de personajes profundo.",
    "unit": 1,
    "price": 22.99,
    "discount": 15,
    "discount_type": "PERCENTAGE",
    "image": "P_31",
    "category": "CIENCIA FICCIÓN"
  },
  {
    "product_id": "32",
    "admin_id": "10",
    "name": "La quinta estación",
    "author": "N.K. Jemisin",
    "description": "En 'La quinta estación', el mundo de la Tierra está en constante cambio, marcado por catástrofes y desastres naturales. La historia sigue a tres mujeres cuyas vidas se entrelazan en medio de un apocalipsis inminente. A través de sus perspectivas, se exploran temas de opresión, resistencia y la lucha por la supervivencia en un mundo que no muestra piedad. Jemisin crea un universo rico y complejo, donde la magia y la ciencia se entrelazan, y donde cada personaje debe enfrentar sus propios demonios mientras lucha por un futuro mejor. La novela es una poderosa reflexión sobre la injusticia social y la resiliencia humana.",
    "unit": 1,
    "price": 25.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_32",
    "category": "FANTASIA"
  },
  {
    "product_id": "33",
    "admin_id": "10",
    "name": "El código Da Vinci",
    "author": "Dan Brown",
    "description": "En 'El código Da Vinci', el profesor de simbología Robert Langdon se ve envuelto en un misterio que involucra un asesinato en el Museo del Louvre. A medida que Langdon y la criptóloga Sophie Neveu desentrañan pistas ocultas en obras de arte y símbolos históricos, descubren una conspiración que podría cambiar la historia de la humanidad. La novela combina elementos de thriller, historia y religión, manteniendo a los lectores en vilo mientras exploran la relación entre fe y razón. Con giros inesperados y un ritmo trepidante, Brown crea una obra que invita a la reflexión sobre la verdad y la interpretación de la historia.",
    "unit": 1,
    "price": 28.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_33",
    "category": "MISTERIO"
  },
  {
    "product_id": "34",
    "admin_id": "10",
    "name": "La caída de la casa Usher",
    "author": "Edgar Allan Poe",
    "description": "En 'La caída de la casa Usher', el narrador visita a su amigo Roderick Usher, quien vive en una mansión antigua y en ruinas. A medida que el narrador se adentra en la vida de Roderick y su hermana Madeline, se desata una serie de eventos sobrenaturales que revelan la decadencia de la familia Usher. Poe explora temas de locura, aislamiento y la influencia del entorno en la psique humana, creando una atmósfera inquietante que mantiene a los lectores en suspenso. La novela es un clásico del horror gótico que examina la fragilidad de la mente y la inevitabilidad de la muerte.",
    "unit": 1,
    "price": 18.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_34",
    "category": "TERROR"
  },
  {
    "product_id": "35",
    "admin_id": "10",
    "name": "El pozo y el péndulo",
    "author": "Edgar Allan Poe",
    "description": "En 'El pozo y el péndulo', un prisionero de la Inquisición se encuentra atrapado en una celda osc ura, enfrentándose a su propia locura mientras es sometido a torturas psicológicas. A medida que el protagonista lucha por su supervivencia, se enfrenta a la incertidumbre de su destino y a la angustia de la muerte inminente. Poe utiliza una prosa vívida para explorar el miedo, la desesperación y la lucha por la libertad, creando una atmósfera de terror psicológico que deja una profunda impresión en el lector. Esta obra es un ejemplo magistral del estilo gótico de Poe, que combina elementos de horror y reflexión sobre la condición humana.",
    "unit": 1,
    "price": 19.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_35",
    "category": "TERROR"
  },
  {
    "product_id": "36",
    "admin_id": "10",
    "name": "El cuervo",
    "author": "Edgar Allan Poe",
    "description": "En 'El cuervo', un hombre solitario es visitado por un misterioso cuervo que parece tener la capacidad de hablar. A medida que el protagonista se sumerge en la tristeza por la pérdida de su amada Lenore, el cuervo se convierte en un símbolo de su desesperación y locura. Poe explora temas de duelo, locura y la búsqueda de respuestas en un mundo caótico, creando una atmósfera inquietante que resuena con los lectores. Esta obra es un clásico de la poesía gótica, que combina la musicalidad del lenguaje con una profunda exploración de la psique humana.",
    "unit": 1,
    "price": 16.50,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_36",
    "category": "TERROR"
  },
  {
    "product_id": "37",
    "admin_id": "10",
    "name": "La sombra de los dioses",
    "author": "John Gwayne",
    "description": "En 'La sombra de los dioses', un grupo de jóvenes se enfrenta a la opresión y la lucha de clases en un mundo donde los dioses han abandonado a la humanidad. A medida que los protagonistas descubren sus propios poderes y se unen en una rebelión, deben navegar por un paisaje de traiciones y alianzas. La novela es una exploración profunda de la amistad, la identidad y la lucha por la libertad, con personajes complejos que enfrentan dilemas morales en su búsqueda de justicia. Gwayne crea un mundo vibrante y lleno de matices, donde cada decisión puede cambiar el destino de muchos.",
    "unit": 1,
    "price": 14.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_37",
    "category": "AVENTURA"
  },
  {
    "product_id": "38",
    "admin_id": "10",
    "name": "Los libros de Terramar",
    "author": "Ursula K. Le Guin",
    "description": "En 'Los libros de Terramar', Le Guin presenta un mundo mágico donde la magia y la responsabilidad están intrínsecamente ligadas. La historia sigue a Ged, un joven con un gran potencial mágico que debe aprender a controlar sus poderes y enfrentar las consecuencias de sus acciones. A medida que Ged se embarca en un viaje de autodescubrimiento, la novela explora temas de poder, identidad y la lucha entre el bien y el mal. Con una prosa poética y una rica construcción del mundo, Le Guin crea una obra que invita a la reflexión sobre la naturaleza de la magia y la humanidad.",
    "unit": 1,
    "price": 29.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_38",
    "category": "FANTASIA"
  },
  {
    "product_id": "39",
    "admin_id": "10",
    "name": "¡Guardias! ¡Guardias!",
    "author": "Terry Pratchett",
    "description": "En '¡Guardias! ¡Guardias!', Pratchett nos lleva a la ciudad de Ankh-Morpork, donde un grupo de inadaptados se une para enfrentar una amenaza mágica que pone en peligro la ciudad. A través de un humor ingenioso y personajes entrañables, la novela explora temas de amistad, valentía y la lucha contra la corrupción. Con su estilo característico, Pratchett combina la fantasía con la sátira social, creando una historia divertida y reflexiva que mantiene a los lectores riendo y pensando al mismo tiempo. La trama se desarrolla en un mundo donde los guardias de la ciudad deben enfrentarse a dragones, conspiraciones y su propia ineptitud, mientras intentan restaurar el orden y la justicia en Ankh-Morpork. '¡Guardias! ¡Guardias!' es una obra que no solo entretiene, sino que también ofrece una crítica aguda sobre la sociedad y la naturaleza humana.",
    "unit": 1,
    "price": 39.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_39",
    "category": "FANTASIA"
  },
  {
    "product_id": "40",
    "admin_id": "10",
    "name": "Mort",
    "author": "Terry Pratchett",
    "description": "En 'Mort', un joven llamado Mort se convierte en aprendiz de la Muerte, quien le enseña los entresijos de su trabajo. Sin embargo, cuando Mort comienza a cuestionar el orden natural de las cosas y decide intervenir en el destino de un alma, se desata una serie de eventos que amenazan con alterar el equilibrio del universo. La novela combina humor, filosofía y una exploración profunda de la vida y la muerte, mientras Mort aprende sobre la responsabilidad y las consecuencias de sus acciones. Pratchett utiliza su ingenio característico para crear una historia que es tanto entretenida como reflexiva.",
    "unit": 1,
    "price": 22.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_40",
    "category": "DRAMA"
  },
  {
    "product_id": "41",
    "admin_id": "10",
    "name": "Snuff",
    "author": "Terry Pratchett",
    "description": "En 'Snuff', el guardia de la ciudad de Ankh-Morpork, Sam Vimes, se embarca en unas vacaciones que rápidamente se convierten en una investigación de un oscuro crimen. A medida que Vimes se adentra en el mundo de la nobleza y la corrupción, debe enfrentarse a sus propios prejuicios y descubrir la verdad detrás de un misterio que amenaza la paz en su ciudad. La novela combina humor, crítica social y una trama intrigante, mientras Pratchett explora temas de justicia, clase y la naturaleza del poder. 'Snuff' es una obra que mantiene el ingenio y la profundidad emocional que caracterizan al autor.",
    "unit": 1,
    "price": 22.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_41",
    "category": "FANTASIA"
  },
  {
    "product_id": "42",
    "admin_id": "10",
    "name": "La corona del pastor",
    "author": "Terry Pratchett",
    "description": "En 'La corona del pastor', Pratchett ofrece una reinterpretación de la historia de Aquiles y Patroclo, explorando los temas del amor, la amistad y el destino en un contexto épico. A medida que los personajes navegan por un mundo lleno de dioses y héroes, deben enfrentarse a sus propios dilemas morales y decisiones difíciles. La novela combina humor, aventura y una profunda reflexión sobre la naturaleza de la humanidad, mientras Pratchett utiliza su estilo característico para crear una historia cautivadora y conmovedora.",
    "unit": 1,
    "price": 19.99,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_42",
    "category": "FANTASIA"
  },
  {
    "product_id": "43",
    "admin_id": "10",
    "name": "Los jardines de la Luna",
    "author": "Steven Erikson",
    "description": "En 'Los jardines de la Luna', Erikson presenta un mundo complejo y lleno de intrigas, donde dioses, mortales y magia se entrelazan en una narrativa épica. La historia sigue a un grupo de personajes cuyas vidas se cruzan en medio de una guerra entre imperios, explorando temas de poder, traición y redención. Con una prosa rica y un desarrollo de personajes profundo, la novela invita a los lectores a sumergirse en un universo fascinante y desafiante, donde cada decisión puede tener consecuencias inesperadas.",
    "unit": 1,
    "price": 24.99,
    "discount": 15,
    "discount_type": "PERCENTAGE",
    "image": "P_43",
 "category": "FANTASIA"
  },
  {
    "product_id": "44",
    "admin_id": "10",
    "name": "Las puertas de la Casa de la Muerte",
    "author": "Steven Erikson",
    "description": "En 'Las puertas de la Casa de la Muerte', un ángel y un demonio se unen en una misión inesperada para evitar el apocalipsis. A medida que navegan por un mundo lleno de humor y absurdos, deben enfrentar sus propios prejuicios y descubrir el verdadero significado de la amistad y la redención. La novela combina elementos de fantasía y comedia, ofreciendo una reflexión profunda sobre la naturaleza del bien y el mal, mientras Erikson utiliza su ingenio para crear una historia entretenida y conmovedora.",
    "unit": 1,
    "price": 18.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_44",
    "category": "FANTASIA"
  },
  {
    "product_id": "45",
    "admin_id": "10",
    "name": "El priorato del naranjo",
    "author": "Samantha Shannon",
    "description": "En 'El priorato del naranjo', Shannon presenta un mundo de alta fantasía donde dragones, magia y política se entrelazan en una narrativa rica y compleja. La historia sigue a un grupo de personajes que luchan por proteger su hogar y sus seres queridos en medio de un conflicto inminente. A medida que se enfrentan a desafíos y revelaciones, la novela explora temas de amor, sacrificio y la lucha por la justicia. Con un desarrollo de personajes excepcional y un mundo vibrante, 'El priorato del naranjo' es una obra que cautiva y emociona.",
    "unit": 1,
    "price": 28.00,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_45",
    "category": "FANTASIA"
  },
  {
    "product_id": "46",
    "admin_id": "10",
    "name": "Las mentiras de Locke Lamora",
    "author": "Scott Lynch",
    "description": "En 'Las mentiras de Locke Lamora', Lynch nos lleva a un mundo de intrigas y engaños, donde un grupo de ladrones se enfrenta a un enemigo formidable. La historia sigue a Locke Lamora, un maestro ladrón que debe utilizar su ingenio y astucia para sobrevivir en un entorno hostil. A medida que se desarrollan las tramas de traición y venganza, la novela explora temas de amistad, lealtad y la lucha por la supervivencia. Con un estilo narrativo cautivador y personajes memorables, Lynch crea una obra que combina acción, humor y reflexión.",
    "unit": 1,
    "price": 21.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_46",
    "category": "AVENTURA"
  },
  {
    "product_id": "47",
    "admin_id": "10",
    "name": "Mares de sangre bajo cielos rojos",
    "author": "Scott Lynch",
    "description": "En 'Mares de sangre bajo cielos rojos', Lynch presenta una historia conmovedora sobre la familia elegida y la autoaceptación en un mundo lleno de desafíos. A medida que los personajes navegan por sus propias luchas y relaciones, la novela explora temas de amor, pérdida y la búsqueda de la identidad. Con una prosa poética y un desarrollo emocional profundo, Lynch crea una obra que resuena con los lectores y los invita a reflexionar sobre la naturaleza de la conexión humana.",
    "unit": 1,
    "price": 19.50,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_47",
    "category": "AVENTURA"
  },
  {
    "product_id": "48",
    "admin_id": "10",
    "name": "La república de los ladrones",
    "author": "Scott Lynch",
    "description": "En 'La república de los ladrones', Lynch ofrece una comedia romántica llena de intrigas y sorpresas, donde el hijo del presidente de los Estados Unidos y el príncipe de Gales se ven envueltos en un juego de poder. A medida que los personajes navegan por un mundo de engaños y alianzas, la novela explora temas de amor, ambición y la lucha por la justicia. Con un estilo ingenioso y personajes carismáticos, Lynch crea una historia que combina humor, romance y acción, manteniendo a los lectores entretenidos mientras reflexionan sobre las complejidades de la política y las relaciones humanas. La trama se desarrolla en un entorno vibrante y lleno de matices, donde cada decisión puede tener consecuencias inesperadas, lo que hace que la novela sea tanto emocionante como reflexiva.",
    "unit": 1,
    "price": 16.99,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_48",
    "category": "AVENTURA"
  },
  {
    "product_id": "49",
    "admin_id": "10",
    "name": "Nuestra señora de París",
    "author": "Victor Hugo",
    "description": "En 'Nuestra señora de París', Victor Hugo narra la historia de Quasimodo, el jorobado de Notre Dame, y su amor no correspondido por la hermosa gitana Esmeralda. Ambientada en la París medieval, la novela explora temas de amor, rechazo, y la lucha entre el bien y el mal en una sociedad marcada por la injusticia. A través de personajes memorables y una prosa poética, Hugo crea un retrato vívido de la vida en la ciudad, mientras aborda cuestiones de identidad, aceptación y redención. La obra es un clásico que ha resonado a lo largo de los años, invitando a los lectores a reflexionar sobre la naturaleza de la belleza y la humanidad.",
    "unit": 1,
    "price": 18.99,
    "discount": 10,
    "discount_type": "PERCENTAGE",
    "image": "P_49",
    "category": "DRAMA"
  },
  {
    "product_id": "50",
    "admin_id": "10",
    "name": "Los Miserables",
    "author": "Sally Rooney",
    "description": "En 'Los Miserables', la historia sigue a Jean Valjean, un exconvicto que busca redimirse y encontrar su lugar en un mundo que lo rechaza. A medida que Valjean se enfrenta a su pasado y a la persecución del inspector Javert, la novela explora temas de amor, sacrificio y la lucha por la justicia en una sociedad desigual. Con un elenco de personajes complejos y una narrativa rica en emociones, la obra de Victor Hugo es un poderoso comentario sobre la condición humana y la búsqueda de la redención. A través de sus experiencias, los lectores son invitados a reflexionar sobre la compasión, la esperanza y el poder del cambio.",
    "unit": 1,
    "price": 17.99,
    "discount": 5,
    "discount_type": "PERCENTAGE",
    "image": "P_50",
    "category": "DRAMA"
  }
]